In [4]:
import pandas as pd

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [5]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [137]:
data[data['country'].str.contains('es',case=False)]['country'].unique()

array(['United States', 'Philippines', 'Bangladesh', 'Lesotho',
       'United Arab Emirates', 'Estonia', 'Indonesia', 'Maldives',
       'Seychelles', 'Neth. Antilles (former)', 'French Polynesia',
       'St. Vincent-Grenadines', 'State of Palestine',
       'Micronesia (Fed. States of)', 'Timor-Leste',
       'United States Virgin Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

# Литва (Lithuania)

In [144]:
countryLithuania = data[ (data['country']=='Lithuania') 
                & (data['quantity'] > 0)
               &(data['year'] > 2005) & (data['year'] < 2010)
               &((data['category']==4)|(data['category']==12)|(data['category']==21))
                       ]
countryLithuania.head()

         country  year  quantity  category
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
13294  Lithuania  2008       1.0         4
13296  Lithuania  2006       1.0         4
16068  Lithuania  2008       1.0         4

In [145]:
sumLithuania = countryLithuania['quantity'].sum()
sumLithuania

86511.0

# Эстония(Estonia)

In [146]:
countryEstonia = data[ (data['country']=='Estonia') 
                & (data['quantity'] > 0)
               &(data['year'] > 2005) & (data['year'] < 2010)
               &((data['category']==4)|(data['category']==12)|(data['category']==21))
                       ]
countryEstonia.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
12755  Estonia  2008       1.0         4
15525  Estonia  2008       1.0         4
17675  Estonia  2008       1.0         4
19854  Estonia  2008       1.0         4

In [147]:
sumEstonia = countryEstonia['quantity'].sum()
sumEstonia

42184.0

# Латвия(Latvia)

In [148]:
countryLatvia = data[ (data['country']=='Latvia') 
                & (data['quantity'] > 0)
               &(data['year'] > 2005) & (data['year'] < 2010)
               &((data['category']==4)|(data['category']==12)|(data['category']==21))
                       ]
countryLatvia.head()

       country  year  quantity  category
210473  Latvia  2009     937.0        21
210474  Latvia  2008     575.0        21
210475  Latvia  2007     558.0        21
210476  Latvia  2006     562.0        21
215660  Latvia  2009    1536.0        21

In [149]:
sumLatvia = countryLatvia['quantity'].sum()
sumLatvia

35860.0

# Суммарное потребление стран

In [151]:
allsum = sumLatvia + sumEstonia + sumLithuania
allsum

164555.0